<template>
  <div id="app">
    <!-- 头部 -->
    <pv-header>
      <pv-back
        slot="left"
        class="pv-header-backbtn">
        <span>文字</span>
      </pv-back>
      <h1 slot="body" class="pv-cutoff">标题</h1>
      <div slot="right" class="pv-cutoff">操作</div>
    </pv-header>
    <!-- /头部 -->

    <!-- 页脚 -->
    <div class="pv-footer">
      <a @click="activeIndex=1">
        <i class="pv-ico xshare"></i>
        <span>分享赚钱</span>
      </a>
      <a @click="activeIndex=2">
        <i class="pv-ico xlearner"></i>
        <span>收徒赚钱</span>
      </a>
      <a @click="activeIndex=3">
        <i class="pv-ico xme"></i>
        <span>个人中心</span>
      </a>
    </div>
    <!-- /页脚 -->

    <!-- 主体 -->
    <pv-slider class="pv-body" :activeIndex="activeIndex">
      <div class="pv-body-inner" v-show="activeIndex === 1" key="1">总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心总体平稳、稳中向好的态势来之不易。今年以来，面对复杂严峻的国际形势和艰巨繁重的国内改革发展稳定任务，各地区各部门按照党中央部署，坚持稳中求进工作总基调，贯彻新发展理念，落实高质量发展要求，以供给侧结构性改革为主线，着力打好防范化解重大风险、精准脱贫、污染防治三大攻坚战，加快改革开放步伐，使改革红利持续释放，新旧动能加快转换，市场预期总体向好，迈向高质量发展的态势良好。经济发展呈现的更多积极变化，增强了中国经济的底气和信心。</div>
      <div class="pv-body-inner" v-show="activeIndex === 2" key="2">难能可贵的是，这些成绩是在当前外部环境不确定性增多、国内结构调整、转型升级扎实推进的大背景下取得的。中国经济大盘“稳”、消费升级势头明显、区域协调动力增强、创新活力不断释放，充分体现了以习近平同志为核心的党中央关于经济工作的决策部署完全正确，充分彰显了我们党在复杂多变的局面下驾驭社会主义市场经济的高超智慧和娴熟能力。在上半年我国经济发展取得新成绩的基础上，坚决贯彻落实好中共中央政治局会议精神和决策部署，继续巩固稳中向好的良好态势，积极应对稳中有变的新问题新挑战，始终坚持稳中求进的工作总基调，才能推动我国经济向高质量发展阶段不断迈进。</div>
      <div class="pv-body-inner" v-show="activeIndex === 3" key="3">纷繁世事多元应，击鼓催征稳驭舟。紧密团结在以习近平同志为核心的党中央周围，以习近平新时代中国特色社会主义思想为指导，坚定信心，锐意进取，扎实工作，我们就一定能确保实现经济社会发展的目标任务，引领中国经济航船劈波斩浪、行稳致远。</div>
    </pv-slider>
    <!-- /主体 -->
  </div>
</template>

<script>
export default {
  name: 'app',
  data () {
    return {
      activeIndex: 3
    }
  }
}
</script>

<style lang="scss">
  @import "@style/main.scss";
</style>
